export interface ChangelogEntry {
  date: string; // YYYY-MM-DD
  title: string; // 主標題
  items: string[]; // 補充說明（選填）
}

export const changelogData: ChangelogEntry[] = [
  {
    date: '2026-02-04',
    title: '加入更新日誌',
    items: [],
  },
  {
    date: '2026-01-27',
    title: '戰地拼圖 & HEXA屬性更新',
    items: [
      '加入新職業蓮的拼圖',
      '新增聯盟等級對應的攻擊隊員數量',
      '角色 HEXA 屬性加入能力總和',
    ],
  },
  {
    date: '2026-01-23',
    title: '裝備資訊加入卓越強化顯示',
    items: [],
  },
  {
    date: '2026-01-20',
    title: '改善創世/命運武器進度計算機的使用體驗',
    items: [
      '按照階段選擇，就不用自己算總共累積多少進度了',
    ],
  },
  {
    date: '2026-01-16',
    title: 'HEXA 進度計算機加入保存功能',
    items: [],
  },
  {
    date: '2025-01-14',
    title: '更新 & 修正回報的問題',
    items: [
      '普通賽連掉落物錯誤的問題',
      '掉落物文字錯誤的問題',
      '加入最初的敵對者資訊',
      '戰地拼圖排序工具 & 秘法符文進度計算機暫時不會開發',
      '海外職業輔助武器不會顯示是正設',
    ],
  },
  {
    date: '2026-01-07',
    title: '角色查詢功能加入現金道具',
    items: [],
  },
  {
    date: '2026-01-05',
    title: '新增網域',
    items: [
      '已遷移至新域名 maple-kit.com，請更新您的書籤',
    ],
  },
  {
    date: '2025-12-30',
    title: '優化 & 改善部分功能',
    items: [
      'Boss 資訊，戴斯克血量錯誤的問題',
      '創世武器進度計算機，日期不能選下一年的問題',
      '修改圖片載入方式',
    ],
  },
  {
    date: '2025-12-21',
    title: '角色查詢功能加入聯盟冠軍',
    items: [],
  },
  {
    date: '2025-12-20',
    title: '角色查詢功能加入聯盟神器',
    items: [],
  },
  {
    date: '2025-12-19',
    title: '角色查詢功能加入聯盟戰地 & 寵物裝備',
    items: [
      '可以看別人怎麼塞 250 法師拼圖進去'
    ],
  },
  {
    date: '2025-12-18',
    title: '優化 & 改善部分功能',
    items: [
      '角色近七日圖表升級顯示異常的問題',
      '優化查詢效能'
    ],
  },
  {
    date: '2025-12-08',
    title: '新增 EXP 交換券進度計算機',
    items: [],
  },
  {
    date: '2025-12-07',
    title: '創世武器進度計算機新增通行證',
    items: [],
  },
  {
    date: '2025-12-05',
    title: '新增贊助功能',
    items: [
      '修正 Boss 資訊，瑪麗西亞掉落物',
    ],
  },
  {
    date: '2025-12-01',
    title: '新增S2挑戰者世界進度計算機',
    items: [
      '順便做了 S1 的版本但是沒有放在列表上',
    ],
  },
  {
    date: '2025-11-24',
    title: '網站整體效能優化',
    items: [
      '修正創世武器 6、7 階段 Boss 相反的問題',
    ],
  },
  {
    date: '2025-11-06',
    title: '角色查詢補上近七日經驗值變化圖表',
    items: [],
  },
  {
    date: '2025-10-29',
    title: '新增 HEXA 技能進度計算機',
    items: [],
  },
  {
    date: '2025-10-20',
    title: '新增 TMS 角色查詢功能',
    items: [],
  },
  {
    date: '2025-10-09',
    title: '新增 Boss 資訊',
    items: [
      '加入問題回報，讓玩家可以回報錯誤資訊 & 建議',
    ],
  },
  {
    date: '2025-09-19',
    title: '新增符文系統',
    items: [],
  },
  {
    date: '2025-09-01',
    title: '新增創世武器進度計算機',
    items: [],
  },
  {
    date: '2025-08-26',
    title: '新增命運武器進度計算機',
    items: [],
  },
];
